(package! catppuccin-theme)
(package! elfeed-tube)
(package! evil-cleverparens)
(package! transpose-frame)
(package! highlight-symbol)
(package! olivetti)
(package! focus)
(package! calendar-norway)
(package! spray)
(package! dired-subtree)
(package! org-ai :recipe (:host github :repo "rksm/org-ai"))
(package! mastodon :recipe (:host codeberg :repo "martianh/mastodon.el"))
(package! hnreader)
(package! reddigg)
(package! blamer :recipe (:host github :repo "artawower/blamer.el"))
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
(package! remark-mode)
;; (package! tempel)
(package! command-log-mode)
;; fix broken doom install for thesaurus on a mac?
(package! wordnut :pin "feac531404041855312c1a046bde7ea18c674915")
;; fix broken doom install for thesaurus on a mac?
(package! synosaurus :pin "14d34fc92a77c3a916b4d58400424c44ae99cd81")
;; grab latest for the ktlint fix
(package! format-all :pin "59924e6bcfeef50d95324a336cb8f4c94366c99f")
(package! recursion-indicator)
